import React, { useState } from "react";
import { useNavigate } from "react-router-dom";

const Agreement_pages = () => {
  const navigate = useNavigate();
  const [isChecked, setIsChecked] = useState(false);

  const handleCheck = () => {
    setIsChecked(!isChecked);
  };
  const handleAgree = (event) => {
    event.preventDefault();
    if (isChecked) {
      navigate("/main-profile");
      // ทำการดำเนินการเมื่อผู้ใช้กด "Agree" และยอมรับข้อตกลง
      console.log("User agreed to terms.");
    } else {
      // แสดงข้อความให้ผู้ใช้เลือกยอมรับก่อน
      alert("โปรด ยอมรับนโยบายการคุ้มครองข้อมูลส่วนบุคคล.!!!");
    }
  };
  return (
    <>
      <div className="h-screen  ">
        <div className=" flex flex-col items-center justify-center h-screen bg-cyan-300 ">
          <div className=" bg-gray-100 rounded-xl">
            <h1 className=" text-3xl text-bold text-black text-center mt-10">
              นโยบายคุ้มครองข้อมูลส่วนบุคคล
            </h1>

            <div className="bg-white p-8 rounded-lg shadow-md max-w-5xl w-full h-96 overflow-y-auto text-black mt-10">
              <h2 className="text-2xl font-semibold mb-4 ">
                นโยบายคุ้มครองข้อมูลส่วนบุคคล
              </h2>
              <div className="font-inter font-bold ">1. หลักการ</div>
              <p className="mt-4 font-inter">
                INFI-LEARN
                เคารพสิทธิความเป็นส่วนตัวในข้อมูลส่วนบุคคลของผู้ใช้บริการทุกท่านที่ใช้บริการผ่านระบบหรือช่องทางการให้บริการใดๆ
                ของ INFI-LEARN และตระหนักในการปกป้องข้อมูลดังกล่าว
                โดยการปฏิบัติตามนโยบายนี้
              </p>
              <p className="font-inter">
                การเข้าถึงหรือการใช้งานผ่านระบบของ INFI-LEARN
                สำหรับการให้บริการตามแบบ B2C นี้ (ตามที่นิยามไว้ด้านล่าง)
                INFI-LEARN
                ถือว่าผู้ใช้บริการตกลงยอมรับเงื่อนไขของนโยบายคุ้มครองข้อมูลส่วนบุคคลของ
                INFI-LEARN ฉบับนี้
              </p>
              <div className="font-inter font-bold mt-4 ">2. คำนิยาม </div>
              <p className="mt-4 font-inter">
                การให้บริการตามแบบ B2C
                <p>
                  การให้บริการคอร์สเรียนออนไลน์ของ INFI-LEARN ให้แก่ผู้ใช้บริการ
                  ซึ่งเป็นบุคคลธรรมดาและ/หรือนิติบุคคลที่ INFI-LEARN กำหนด
                  ผ่านระบบการให้บริการของ INFI-LEARN
                  โดยมีข้อกำหนดและเงื่อนไขในการให้บริการเป็นไปตามข้อตกลงระหว่าง
                  INFI-LEARN และผู้ใช้บริการ
                  (รวมถึงผู้ใช้บริการในโครงการการศึกษาออนไลน์ฯ ที่ INFI-LEARN
                  กำหนด และโครงการ TUXSA)
                </p>
              </p>
              <p className="font-inter">
                กฎหมายคุ้มครองข้อมูลส่วนบุคคล
                <p>
                  พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
                  และที่แก้ไขเพิ่มเติม รวมถึงประกาศและระเบียบที่เกี่ยวข้อง
                </p>
              </p>
              <p className="mt-4 font-inter">
                ข้อมูลที่เก็บรวบรวม
                <p>
                  หมายถึง ข้อมูลส่วนบุคคลที่ INFI-LEARN ดำเนินการเก็บรวบรวม ใช้
                  หรือเปิดเผยตามที่นโยบายนี้กำหนด
                  โดยข้อมูลดังกล่าวจะถูกเก็บรวบรวมโดยอัตโนมัติเมื่อผู้ใช้บริการดำเนินการเข้าถึงหรือล็อกอิน
                  (Log in) หรือใช้บริการระบบการให้บริการของ INFI-LEARN
                </p>
              </p>
              <p className="mt-4 font-inter">
                ข้อมูลส่วนบุคคล
                <p>
                  หมายถึง
                  ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม
                  รวมถึงข้อมูลอื่นตามที่นโยบายนี้หรือกฎหมายคุ้มครองข้อมูลส่วนบุคคลกำหนด
                </p>
              </p>
              <p className="mt-4 font-inter">
                โครงการการศึกษาออนไลน์ฯ
                <p>
                  หมายถึง
                  โครงการการศึกษาทางออนไลน์โดยความร่วมมือและจัดทำระหว่างสถาบันการศึกษา
                  (อาทิ มหาวิทยาลัยและวิทยาลัย)
                  ไม่ว่าจะเป็นหน่วยงานราชการหรือเอกชน กับ INFI-LEARN
                  ซึ่งมีนักเรียน นักศึกษาหรือบุคคลทั่วไปเป็นผู้ใช้บริการ
                  โดยมีเงื่อนไขตามที่โครงการแต่ละโครงการกำหนด (ทั้งนี้
                  ไม่รวมถึงโครงการ TUXSA)
                </p>
              </p>
              <p className="mt-4 font-inter">
                โครงการ TUXSA
                <p>
                  หมายถึง
                  โครงการการศึกษาทางออนไลน์โดยความร่วมมือและจัดทำระหว่างมหาวิทยาลัยธรรมศาสตร์และ
                  INFI-LEARN โดยมีเงื่อนไขตามที่โครงการกำหนด
                </p>
              </p>
              <p className="mt-4 font-inter">
                ผู้ใช้บริการ
                <p>
                  หมายถึง ผู้เข้าชม ลูกค้า ผู้ใช้บริการในโครงการการศึกษาออนไลน์ฯ
                  หรือผู้ใช้บริการของ INFI-LEARN
                  ที่เป็นบุคคลผู้ใช้บริการในการให้บริการตามแบบ B2C
                  และให้รวมถึงผู้ใช้อำนาจปกครองที่มีอำนาจกระทำการแทนผู้เยาว์
                  ผู้อนุบาล และผู้พิทักษ์
                </p>
              </p>
              <p className="mt-4 font-inter">
                ระบบการให้บริการ
                <p>
                  หมายถึง ระบบหรือช่องทางการให้บริการของ INFI-LEARN ดังนี้ (ก)
                  www.INFI-LEARN.com
                  และให้หมายความรวมถึงแอปพลิเคชันสำหรับการใช้บริการผ่านโทรศัพท์มือถือหรือเครื่องมืออิเล็กทรอนิกส์
                  หรือ (ข) คอร์สเรียนออนไลน์ หรือ (ค) ช่องทางในเครือพันธมิตรของ
                  INFI-LEARN ตามที่ INFI-LEARN แจ้งให้ทราบ (ง)
                  หรือการให้บริการผ่านช่องทางอื่นใดตามที่ INFI-LEARN กำหนด
                </p>
              </p>
              <div className="font-inter font-bold mt-4 ">3. ขอบเขต </div>
              <p className="mt-4 font-inter">
                นโยบายคุ้มครองข้อมูลส่วนบุคคลของ INFI-LEARN
                นี้ใช้ภายใต้ระบบการให้บริการของ INFI-LEARN
                รวมถึงช่องทางซึ่งสามารถเข้าถึงได้ภายในแพลตฟอร์มในเว็บไซต์นี้
                ทั้งนี้
                อาจมีการแสดงข้อกำหนดซึ่งเกี่ยวข้องกับนโยบายคุ้มครองข้อมูลส่วนบุคคลเพิ่มเติมในการให้บริการ
                เพื่อให้ผู้ใช้บริการอนุมัติก่อนการเข้าถึงบริการนั้นๆ
              </p>
              <p>
                ทั้งนี้ INFI-LEARN ได้จัดเก็บ รวบรวม ใช้
                เปิดเผยและประมวลข้อมูลส่วนบุคคลตามนโยบายคุ้มครองข้อมูลส่วนบุคคลนี้
                จากระบบการให้บริการของ INFI-LEARN โดย INFI-LEARN จะเก็บรักษา
                รวบรวม ใช้
                เปิดเผยและประมวลข้อมูลไว้เป็นความลับภายใต้เงื่อนไขที่กำหนดไว้ในนโยบายฉบับนี้เท่านั้นและ
                INFI-LEARN จะจัดเก็บ รวบรวม ใช้
                เปิดเผยและประมวลข้อมูลส่วนบุคคลของเจ้าของข้อมูล
                โดยได้รับความยินยอมจากเจ้าของข้อมูลด้วยวิธีการตามที่กฎหมายกำหนด
                เว้น
              </p>
              <p>
                แต่กรณีที่กฎหมายกำหนดเงื่อนไขหรือเหตุผลอื่นที่ให้ทำได้โดยไม่ต้องขอความยินยอมจากเจ้าของข้อมูลส่วนบุคคล
                เช่น
                ฐานการปฏิบัติตามสัญญาในการเข้าทำหรือปฏิบัติตามสัญญาเกี่ยวกับการให้บริการ
                ฐานการปฏิบัติตามกฎหมายเพื่อปฏิบัติหน้าที่ตามกฎหมาย
                ฐานประโยชน์โดยชอบด้วยกฎหมายของ ผู้ควบคุมข้อมูล
                ภายใต้เงื่อนไขประโยชน์โดยชอบด้วยกฎหมายของบริษัทฯ
                ในฐานะผู้ควบคุมข้อมูล ฐานประโยชน์ต่อชีวิต
                เพื่อป้องกันและยับยั้งอันตรายต่อชีวิต ร่างกาย หรือสุขภาพ
                ฐานประโยชน์สาธารณะ เพื่อการปฏิบัติภารกิจเพื่อประโยชน์สาธารณะ
                หรือเพื่อการใช้อำนาจรัฐ หรือเหตุอื่นที่กฎหมายบัญญัติ เป็นต้น
              </p>
              <p className="mt-4 font-inter">
                เว้นแต่นโยบายฉบับนี้จะกำหนดไว้เป็นอย่างอื่น การจัดเก็บรวบรวม ใช้
                เปิดเผยและประมวลข้อมูลส่วนบุคคลจะไปยังไม่นำหลักกฎหมายคุ้มครองข้อมูลส่วนบุคคลมาใช้บังคับ
                จนกว่ากฎหมายคุ้มครองข้อมูลส่วนบุคคลจะมีผลใช้บังคับ ซึ่ง
                INFI-LEARN จะแจ้งให้ทราบต่อไป
              </p>
              <p className="mt-4 font-inter">
                อย่างไรก็ตาม
                นโยบายการคุ้มครองข้อมูลส่วนบุคคลนี้จะไม่ใช้กับข้อมูลซึ่งจะได้เปิดเผยหรือทำการส่งไปยัง
              </p>
              <p>
                ● การบริการอื่นๆ นอกเหนือจากที่กำหนดในระบบการให้บริการของ
                INFI-LEARN
              </p>
              <p>
                ● การบริการของบุคคลที่สาม รวมถึงเว็บไซต์ของบุคคลที่สาม
                ซึ่งผู้ใช้บริการอาจเข้าถึงโดยผ่านทางเว็บไซต์ของ INFI-LEARN
              </p>
              <p>
                ● บริษัทหรือองค์กร
                ซึ่งได้ทำการโฆษณาสินค้าหรือบริการในเว็บไซต์ของ INFI-LEARN
              </p>
              <p className="mt-4 font-inter">
                โดยหากผู้ใช้บริการได้กดลิงก์ (Link) ไปยังเว็บไซต์อื่น
                (แม้จะผ่านระบบการให้บริการของ INFI-LEARN)
                ผู้ใช้บริการจะต้องศึกษาและปฏิบัติตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลที่ปรากฎในเว็บไซต์นั้นๆ
                แยกต่างหากจากของ INFI-LEARN นี้
              </p>
              <div className="font-inter font-bold mt-4 ">
                4. วัตถุประสงค์ของการจัดเก็บและการใช้ข้อมูลที่เก็บรวบรวม
              </div>
              <p className="mt-4 font-inter">
                นอกเหนือจากวัตถุประสงค์ที่กำหนดไว้ในข้อ 5. ของนโยบายนี้
                INFI-LEARN มีความประสงค์จะเก็บรวบรวม ใช้
                หรือเปิดเผยข้อมูลที่เก็บรวบรวม เพื่อวัตถุประสงค์ดังต่อไปนี้
                โดยทาง INFI-LEARN
                จะใช้ข้อมูลส่วนบุคคลที่ได้รับจากผู้ใช้บริการเพื่อ
              </p>
              <p>
                ● เพื่อจัดหาข้อมูลเกี่ยวกับการให้บริการต่างๆ ของ INFI-LEARN
                ซึ่งผู้ใช้บริการร้องขอ
              </p>
              <p>
                ● เพื่อนำเสนอหรือเป็นข้อมูลเกี่ยวกับการให้บริการต่างๆ ของ
                INFI-LEARN แก่ผู้ใช้บริการ อาทิ
                การวิเคราะห์ผลการเรียนให้เป็นข้อมูลของผู้ใช้บริการ
                หรือเพื่อรวบรวมฐานข้อมูลเชิงสถิติเกี่ยวกับบริการของ INFI-LEARN
              </p>
              <p>
                ● เพื่อรวบรวมข้อมูลเป็นฐานข้อมูลลูกค้าของ INFI-LEARN
                หรือข้อมูลเชิงสถิติเกี่ยวกับจำนวนผู้เยี่ยมชมเว็บไซต์
                ปริมาณการขาย เพื่อนำไปวิเคราะห์ทางการตลาดหรือเสนอบริการใหม่ๆ
                แก่ผู้ใช้บริการ
              </p>
              <p>
                ● เพื่อเป็นช่องทางการติดต่อกับผู้ใช้บริการเกี่ยวกับการปรับปรุง
                แก้ไข เปลี่ยนแปลงระบบการให้บริการของ INFI-LEARN
              </p>
              <p>
                ● เพื่อดำเนินการด้านโฆษณาตามความสนใจ (interest-based
                advertising)
                และอาจมีการรวบรวมและ/หรือมีการส่งข้อมูลดังกล่าวให้ผู้ใช้บริการต่อไปในลักษณะ
                (interest-based advertising)
              </p>
              <p>
                ● เพื่อเป็นข้อมูลในการให้เรียนและบริการในโครงการ TUXSA
                สำหรับผู้ใช้บริการที่ลงทะเบียนเรียนในโครงการดังกล่าวผ่านระบบการให้บริการ
              </p>
              <p>
                ● เพื่อเป็นข้อมูลในการเรียนและบริการในโครงการศึกษาออนไลน์ฯ กับ
                INFI-LEARN และตัวแทนสถาบันการศึกษา
                หรือสถาบันการศึกษาที่เป็นผู้ร่วมจัดโครงการการศึกษาออนไลน์ฯ
              </p>
              <p>
                ● เพื่อปฏิบัติตามภาระหน้าที่และตามสิทธิของ INFI-LEARN
                ภายใต้เงื่อนไขตามข้อตกลงหรือสัญญาฉบับใดๆ
                ที่เข้าทำระหว่างผู้ใช้บริการกับ INFI-LEARN
              </p>
              <p>
                ● เพื่อปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
                หรือกระบวนการทางกฎหมายที่เกี่ยวข้อง
                รวมถึงเพื่อดำเนินการตามการร้องขอของเจ้าหน้าที่ตามกฎหมายหรือทางราชการ
              </p>
              <p>
                ● เพื่อการปกป้องหรือประโยชน์ต่อสิทธิ ทรัพย์สิน
                หรือเพื่อความปลอดภัยของ INFI-LEARN และ/หรือผู้ใช้บริการ
                หรือบุคคลอื่น ในกรณีหาก INFI-LEARN
                พิจารณาแล้วเห็นว่าการเก็บรวบรวมใช้
                หรือเปิดเผยนั้นมีความจำเป็นหรือเหมาะสม
              </p>
              <div className="font-inter font-bold mt-4 ">
                5. ข้อมูลที่เก็บรวมรวมและการนำไปใช้
              </div>
              <p className="font-inter mt-4">
                5.1 การให้บริการให้กับผู้ใช้บริการทั่วไป
                (รวมถึงผู้ใช้บริการในโครงการการศึกษาออนไลน์)
              </p>
              <p className="font-inter mt-4">
                ประเภทข้อมูลที่เก็บรวบรวมและวัตถุประสงค์
              </p>
              <p>
                ประเภทข้อมูลชื่อ-นามสกุล / คำนำหน้า / ที่อยู่ / อีเมล (e-mail) /
                วันเกิด / เพศ /เบอร์โทรศัพท์ / รูปภาพ / การตั้งค่าต่างๆ /
                ข้อมูลที่ตั้ง (Location) / ไอพี แอดเดรส (IP Address) /
                เลขบัตรประจำตัวประชาชน / หมายเลขประกาศนียบัตร
              </p>
              <p>วัตถุประสงค์</p>
              <p>● เพื่อตรวจสอบตัวตนของผู้ใช้บริการ</p>
              <p>
                ●เพื่อเป็นข้อมูลสำหรับการใช้บริการและเข้าระบบการให้บริการของแต่ละบัญชีผู้ใช้บริการ
              </p>
              <p>● เพื่อรักษาความปลอดภัยต่อบัญชีผู้ใช้บริการ</p>
              <p>
                ●เพื่อเป็นช่องทางการติดต่อกับผู้ใช้บริการในด้านต่างๆ อาทิ
                การจัดสัมมนา การสำรวจความพึงพอใจ การให้รางวัลหรือสิทธิพิเศษ
              </p>
              <p>
                ●เพื่อตรวจสอบและแจ้งผลการเรียนหรืออบรม การตอบโต้บทสนทนา
                (Discussion Board) การส่งหนังสือรับรองการผ่านการเรียนหรืออบรม
              </p>
              <p>●เพื่อเป็นข้อมูลยืนยันการผ่านการทดสอบหรือจบหลักสูตรวิชา</p>
              <p>ประเภทข้อมูลคุกกี้ (Cookies)</p>
              <p>วัตถุประสงค์</p>
              <p>
                ●
                เพื่อเป็นข้อมูลที่อาจเป็นประโยชน์ต่อผู้ใช้บริการในครั้งถัดไปที่ผู้ใช้บริการกลับมาเยี่ยมชมเว็บไซต์ของ
                INFI-LEARN
              </p>
              <p>ประเภทข้อมูลข้อมูลบัตรเครดิต</p>
              <p>วัตถุประสงค์</p>
              <p>
                ● เพื่อเป็นช่องทางการชำระเงินตามที่ผู้ใช้บริการกำหนด ทั้งนี้
                ข้อมูลบัตรเครดิตจะถูกจัดเก็บและถูกตรวจสอบผ่านทางระบบชำระเงินผ่านบุคคลที่สาม
                ข้อมูลนี้จะไม่ถูกจัดเก็บอย่างถาวรในเซิร์ฟเวอร์ของ INFI-LEARN
                และจะถูกลบทันทีหลังจากผ่านระบบการตรวจสอบโดยระบบชำระเงินของบุคคลที่สาม
              </p>
              <p>ประเภทข้อมูลข้อมูลการเรียนหรือการใช้บริการคอร์สเรียนออนไลน์</p>
              <p>วัตถุประสงค์</p>
              <p>
                ● เพื่อเป็นการติดตามประวัติ ประสบการณ์ และความคืบหน้า
                รวมถึงจัดทำข้อมูลในการเรียนคอร์สเรียนออนไลน์ผ่านระบบการให้บริการ
              </p>
            </div>

            <div className="mt-4 ">
              <label className="flex text-black ml-3 ">
                <input
                  type="checkbox"
                  className="mr-2"
                  checked={isChecked}
                  onChange={handleCheck}
                />
                ยอมรับนโยบายการคุ้มครองข้อมูลส่วนบุคคล 
              </label>
              <div className="flex justify-center item-center mt-4 ">
                <button
                  className="btn btn-primary text-white px-4 py-2 rounded-md mb-2"
                  onClick={handleAgree}
                >
                  ยอมรับ
                </button>
              </div>
            </div>
          </div>
        </div>
      </div>
    </>
  );
};

export default Agreement_pages;
